<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"fa6039b89d1316c4e72d80d3692f15337132bf5e63a5ed2f81bee6d5fed0e6cc","plan_job_ref":"Job Create terraform plan #64 at https://github.com/presentium/infrastructure/actions/runs/10523757554","plan_out_hash":"dfd59738aeb6fe75a30e656f09a7894fde9a9ceba13fa18b58234742cbbdc368","plan_hash":"ca6b7ea125414df044fe490e9053c9d5f03093a143a60af3cd0f8cb3c5efb74a","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __infrastructure__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.eks.kubernetes_storage_class_v1.ebs will be created
+   resource "kubernetes_storage_class_v1" "ebs" {
+       allow_volume_expansion = true
+       id                     = (known after apply)
+       parameters             = {
+           "tagSpecification1" = "Managed_by=aws-ebs-csi-driver"
        }
+       reclaim_policy         = "Retain"
+       storage_provisioner    = "ebs.csi.aws.com"
+       volume_binding_mode    = "WaitForFirstConsumer"

+       metadata {
+           generation       = (known after apply)
+           name             = "ebs"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #64](https://github.com/presentium/infrastructure/actions/runs/10523757554)